InformationRegisters/бит_ГражданствоПроживающих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ГражданствоПроживающих</Name>
			<Comment>БИТ</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИмеетПравоНаПенсию</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеЯвляетсяНалоговымРезидентомРФ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИмеетПравоНаМедицинскоеСтрахование</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ГражданствоПроживающих/Forms/ФормаЗаписиДополнительнаяУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ФизЛицоПриОткрытии                         = Запись.ФизЛицо;
	ПериодПриОткрытии   					   = Запись.Период;
	НеИмеетПравоНаПенсиюПриОткрытии		       = Запись.НеИмеетПравоНаПенсию;
	НеЯвляетсяНалоговымРезидентомРФПриОткрытии = Запись.НеЯвляетсяНалоговымРезидентомРФ;
	СтранаПриОткрытии 						   = Запись.Страна;
	        
	Заголовок = Заголовок + " " + Запись.ФизЛицо;
	
	Прочитать();
	
	// У записи обязательно должны быть заполнены реквизиты ФизЛицо и Период.
	Если Запись.ФизЛицо.Пустая() Тогда
	    Запись.ФизЛицо = ФизЛицоПриОткрытии;
		Запись.Период  = ПериодПриОткрытии;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","Гражданство"), Запись.ФизЛицо);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Если поменяли дату, то тогда новая  запись
	Если ПериодПриОткрытии <> Запись.Период Тогда
		
		// Если что-то поменяли тогда запишем 
		Если НеИмеетПравоНаПенсиюПриОткрытии <> Запись.НеИмеетПравоНаПенсию ИЛИ
			НеЯвляетсяНалоговымРезидентомРФПриОткрытии <> Запись.НеЯвляетсяНалоговымРезидентомРФ ИЛИ
			СтранаПриОткрытии <> Запись.Страна Тогда
		
			МенеджерЗаписи = РегистрыСведений.бит_ГражданствоПроживающих.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период   = Запись.ПериодПриОткрытии;
			МенеджерЗаписи.ФизЛицо  = Запись.ФизЛицо;
			МенеджерЗаписи.НеИмеетПравоНаПенсию  		   = НеИмеетПравоНаПенсиюПриОткрытии;
			МенеджерЗаписи.НеЯвляетсяНалоговымРезидентомРФ = НеЯвляетсяНалоговымРезидентомРФПриОткрытии;
			МенеджерЗаписи.Страна						   = СтранаПриОткрытии;
			
			МенеджерЗаписи.Записать();
			
		КонецЕсли; 
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура История(Команда)
	
	ФормаРегистра = ОткрытьФорму("РегистрСведений.бит_ГражданствоПроживающих.Форма.ФормаСпискаУправляемая");
	ФормаРегистра.Список.Отбор.ФизЛицо.Значение = Запись.ФизЛицо;
	ФормаРегистра.Список.Отбор.ФизЛицо.ВидСравнения = ВидСравнения.Равно;
	ФормаРегистра.Список.Отбор.ФизЛицо.Использование = Истина;
	ФормаРегистра.Элементы.Список.НачальноеОтображениеСписка = НачальноеОтображениеСписка.Конец;
	
КонецПроцедуры

#КонецОбласти
